InformationRegisters/ВерсииЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ВерсииЗаявокКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияИзменений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВерсииЗаявокКабинетСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВерсияИзменений(ТипЗаявки) Экспорт
	
	ВерсияИзменений = 0;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВерсииЗаявокКабинетСотрудника.ВерсияИзменений КАК Версия
	|ИЗ
	|	РегистрСведений.ВерсииЗаявокКабинетСотрудника КАК ВерсииЗаявокКабинетСотрудника
	|ГДЕ
	|	ВерсииЗаявокКабинетСотрудника.ТипЗаявки = &ТипЗаявки");
	Запрос.УстановитьПараметр("ТипЗаявки", ТипЗаявки);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВерсияИзменений = Выборка.Версия;
	КонецЕсли;
	
	Возврат ВерсияИзменений;
	
КонецФункции

Процедура ЗаписатьВерсию(ТипЗаявки, Версия) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВерсииЗаявокКабинетСотрудника.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипЗаявки = ТипЗаявки;
	МенеджерЗаписи.ВерсияИзменений = Версия;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
